In [1]:
import pandas as pd

In [2]:
students = pd.read_csv('students.csv')

In [3]:
students

      Name Major  Level   GPA
0     Reem    CS    5.0  4.40
1     Nada    IT    9.0  4.80
2     Sara    IS    3.0  3.45
3     Majd    IT    4.0  4.71
4  Alanoud    CS    9.0  4.88
5     Amal    IT    4.0  4.99
6     Aziz   NaN    NaN   NaN

In [4]:
#aggregation functions
students['Level'].max()

9.0

In [5]:
students['Level'].min()

3.0

In [6]:
students['GPA'].sum()

27.229999999999997

In [7]:
#the apply() Function
def gpaBouns(gpa):
    gpa = gpa+0.01
    return gpa

In [8]:
students['GPA'].apply(gpaBouns)#(function you want)

0    4.41
1    4.81
2    3.46
3    4.72
4    4.89
5    5.00
6     NaN
Name: GPA, dtype: float64

In [9]:
students['GPA'] = students['GPA'].apply(gpaBouns)#(function you want)

In [10]:
students

      Name Major  Level   GPA
0     Reem    CS    5.0  4.41
1     Nada    IT    9.0  4.81
2     Sara    IS    3.0  3.46
3     Majd    IT    4.0  4.72
4  Alanoud    CS    9.0  4.89
5     Amal    IT    4.0  5.00
6     Aziz   NaN    NaN   NaN

In [11]:
#removing data
students.drop('Name',axis=1)#(column,axis)

  Major  Level   GPA
0    CS    5.0  4.41
1    IT    9.0  4.81
2    IS    3.0  3.46
3    IT    4.0  4.72
4    CS    9.0  4.89
5    IT    4.0  5.00
6   NaN    NaN   NaN

In [12]:
students.drop('Name',axis=1,inplace=True)#(column,axis=1=y)

In [13]:
students

  Major  Level   GPA
0    CS    5.0  4.41
1    IT    9.0  4.81
2    IS    3.0  3.46
3    IT    4.0  4.72
4    CS    9.0  4.89
5    IT    4.0  5.00
6   NaN    NaN   NaN

In [14]:
students.drop(3,axis=0, inplace=True)#(row,axis=0=x)

In [15]:
students

  Major  Level   GPA
0    CS    5.0  4.41
1    IT    9.0  4.81
2    IS    3.0  3.46
4    CS    9.0  4.89
5    IT    4.0  5.00
6   NaN    NaN   NaN

In [16]:
#the dropna function removes the null data
students.dropna(how='all',axis=0)

  Major  Level   GPA
0    CS    5.0  4.41
1    IT    9.0  4.81
2    IS    3.0  3.46
4    CS    9.0  4.89
5    IT    4.0  5.00

In [17]:
students.dropna(how='any',axis=0)#no need for all the row to be null

  Major  Level   GPA
0    CS    5.0  4.41
1    IT    9.0  4.81
2    IS    3.0  3.46
4    CS    9.0  4.89
5    IT    4.0  5.00

In [18]:
students.dropna(how='all',axis=1)#nothing changed

  Major  Level   GPA
0    CS    5.0  4.41
1    IT    9.0  4.81
2    IS    3.0  3.46
4    CS    9.0  4.89
5    IT    4.0  5.00
6   NaN    NaN   NaN

In [19]:
students.dropna(how='any',axis=1)#no need for all the row to be null

Empty DataFrame
Columns: []
Index: [0, 1, 2, 4, 5, 6]

In [20]:
students = pd.read_csv('students.csv')
students

      Name Major  Level   GPA
0     Reem    CS    5.0  4.40
1     Nada    IT    9.0  4.80
2     Sara    IS    3.0  3.45
3     Majd    IT    4.0  4.71
4  Alanoud    CS    9.0  4.88
5     Amal    IT    4.0  4.99
6     Aziz   NaN    NaN   NaN

In [23]:
#the fillna() function
students.fillna(0)#(any value you want to replace the null value)

      Name Major  Level   GPA
0     Reem    CS    5.0  4.40
1     Nada    IT    9.0  4.80
2     Sara    IS    3.0  3.45
3     Majd    IT    4.0  4.71
4  Alanoud    CS    9.0  4.88
5     Amal    IT    4.0  4.99
6     Aziz     0    0.0  0.00

In [26]:
#the sort_value() and sort_index Functions
students.sort_values(by='GPA',ascending=False,inplace=True)#(Column, Ascending)

In [27]:
students

      Name Major  Level   GPA
5     Amal    IT    4.0  4.99
4  Alanoud    CS    9.0  4.88
1     Nada    IT    9.0  4.80
3     Majd    IT    4.0  4.71
0     Reem    CS    5.0  4.40
2     Sara    IS    3.0  3.45
6     Aziz   NaN    NaN   NaN

In [28]:
students.sort_index(axis=0,ascending=True,inplace=True)
students

      Name Major  Level   GPA
0     Reem    CS    5.0  4.40
1     Nada    IT    9.0  4.80
2     Sara    IS    3.0  3.45
3     Majd    IT    4.0  4.71
4  Alanoud    CS    9.0  4.88
5     Amal    IT    4.0  4.99
6     Aziz   NaN    NaN   NaN

In [31]:
#the groupby  functions
students[['Major','GPA']].groupby('Major').mean()#[[Column,column]].groupby(column).aggregation function()

            GPA
Major
CS     4.640000
IS     3.450000
IT     4.833333